{
  "slug": "architects-designers-join-gatsby-for-la-fix-and-flip-projects",
  "title": "Architects & Designers: Join Gatsby for LA Fix-and-Flip Projects",
  "createdAt": "2025-11-10T22:45:38.005Z",
  "updatedAt": "2025-11-10T22:45:38.005Z",
  "date": "2025-11-10",
  "excerpt": "Gatsby Investment is seeking architects and interior designers to collaborate on a steady stream of fix-and-flip and ground-up development projects in Los Angeles. Enjoy consistent work, portfolio growth, and the chance to focus on your craft while we handle the business side.",
  "image": "https://res.cloudinary.com/dfr4brde4/image/upload/v1762814735/flipwise/blog/architects-designers-join-gatsby-for-la-fix-and-flip-projects-1762814733985.jpg",
  "content": [
    {
      "type": "subheader",
      "text": "Why Partner with Gatsby for Fix-and-Flip Projects?"
    },
    {
      "type": "list",
      "items": [
        "Steady pipeline of fix-and-flip and new build projects—no need to hunt for clients.",
        "Boost your credibility by partnering with an established real estate investment company.",
        "Diverse project types: from budget-conscious flips to luxury renovations and new construction.",
        "Collaborate closely with our in-house team and have your design input valued at every stage.",
        "Expand your portfolio with high-quality, market-ready homes."
      ]
    },
    {
      "type": "subheader",
      "text": "What We’re Looking For"
    },
    {
      "type": "list",
      "items": [
        "Licensed architects with experience in single-family and multi-family residential projects.",
        "Strong understanding of LA zoning laws and building codes.",
        "Ability to balance creative design with practical, investment-focused solutions.",
        "Proven track record of meeting deadlines and working within budgets.",
        "Interior designers with a knack for both high-end and value-driven renovations.",
        "Knowledge of materials and finishes that appeal to LA buyers and investors.",
        "Excellent collaboration skills to work with investors, contractors, and homeowners."
      ]
    },
    {
      "type": "subheader",
      "text": "How to Join Our Network"
    },
    {
      "type": "list",
      "items": [
        "Sign up for a free account on our platform.",
        "Complete a brief questionnaire about your experience and expertise.",
        "We’ll review your credentials and portfolio.",
        "If you’re a fit, we’ll schedule a meeting to discuss collaboration.",
        "Join our exclusive network and start working on new fix-and-flip opportunities."
      ]
    },
    {
      "type": "paragraph",
      "text": "If you’re ready to focus on design while we handle the logistics, Gatsby wants to work with you. Help us transform LA’s neighborhoods, one project at a time!"
    }
  ]
}