{
  "slug": "carried-interest-what-fix-and-flip-investors-need-to-know",
  "title": "Carried Interest: What Fix-and-Flip Investors Need to Know",
  "createdAt": "2025-11-10T06:04:02.388Z",
  "updatedAt": "2025-11-10T06:04:02.388Z",
  "date": "2025-11-10",
  "excerpt": "Carried interest is a key way project managers and sponsors get paid in real estate deals—including fix-and-flip projects. Understanding how it works can help you structure your deals, align incentives, and maximize your profits.",
  "image": "https://res.cloudinary.com/dfr4brde4/image/upload/v1762754640/flipwise/blog/carried-interest-what-fix-and-flip-investors-need-to-know-1762754640140.jpg",
  "content": [
    {
      "type": "subheader",
      "text": "What is Carried Interest?"
    },
    {
      "type": "paragraph",
      "text": "Carried interest is a share of the profits paid to the project manager or sponsor—often called the General Partner (GP)—in a real estate investment. For fix-and-flip deals, this means the person or company running the project gets a percentage of the profits if the deal performs well. This aligns their interests with investors, since the more profitable the flip, the more everyone makes."
    },
    {
      "type": "subheader",
      "text": "How Does Carried Interest Work in Fix-and-Flip Deals?"
    },
    {
      "type": "paragraph",
      "text": "When multiple investors pool money for a fix-and-flip, they usually form an LLC or partnership. The GP (often the project sponsor or manager) handles finding, renovating, and selling the property. Limited Partners (LPs) provide most of the capital. If the flip is profitable, the GP receives a set percentage of the profits as carried interest—commonly 15-20%."
    },
    {
      "type": "list",
      "text": "Typical fix-and-flip deal structure:",
      "items": [
        "LPs contribute most of the capital.",
        "GP manages the project and makes key decisions.",
        "After selling the property, profits are split: LPs get their initial investment back, then profits are divided (e.g., 80% to LPs, 20% to GP as carried interest)."
      ]
    },
    {
      "type": "subheader",
      "text": "What is a Hurdle Rate?"
    },
    {
      "type": "paragraph",
      "text": "Some deals set a minimum return (the 'hurdle rate') that must be achieved before the GP earns carried interest. For example, if the hurdle rate is 8%, the LPs get the first 8% return on their investment. Only profits above this threshold are split with the GP."
    },
    {
      "type": "subheader",
      "text": "How to Calculate Carried Interest"
    },
    {
      "type": "paragraph",
      "text": "Carried interest is calculated as a percentage of total profits. For example, if a fix-and-flip project earns $100,000 in profit and the carried interest is 20%, the GP receives $20,000, and the remaining $80,000 is split among the investors."
    },
    {
      "type": "subheader",
      "text": "Tax Treatment of Carried Interest"
    },
    {
      "type": "paragraph",
      "text": "As of 2024, carried interest is taxed as capital gains (not ordinary income), which usually means a lower tax rate for the GP. However, the investment must typically be held for at least three years to qualify for long-term capital gains rates."
    },
    {
      "type": "subheader",
      "text": "Why Carried Interest Matters for Fix-and-Flip Investors"
    },
    {
      "type": "paragraph",
      "text": "Paying carried interest reduces the profits available to investors, but it also motivates the GP to maximize returns. Without a skilled manager, many fix-and-flip projects wouldn’t succeed—or even happen at all. Carried interest ensures the GP is incentivized to deliver strong results."
    },
    {
      "type": "subheader",
      "text": "Common Questions"
    },
    {
      "type": "list",
      "text": "FAQs for fix-and-flip investors:",
      "items": [
        "Why is it called 'carried interest'? The term dates back to shipping days, when captains earned a share of profits for carrying goods—similar to GPs earning a share for 'carrying' the project.",
        "What if the project underperforms? Some agreements have a 'clawback' clause, allowing investors to reclaim some carried interest if returns fall short.",
        "Is there controversy? Some argue carried interest should be taxed as regular income, but it’s currently taxed as capital gains."
      ]
    },
    {
      "type": "subheader",
      "text": "How to Use Carried Interest in Your Fix-and-Flip Deals"
    },
    {
      "type": "paragraph",
      "text": "Whether you’re raising money for a flip or investing passively, understanding carried interest helps you structure deals that attract strong project managers and align everyone’s incentives. For passive investors, it means you can benefit from expert management while enjoying hands-off returns."
    }
  ]
}