{
  "slug": "sb-1123-updates-subdivision-review-rules",
  "title": "SB 1123 Updates Subdivision Review Rules",
  "createdAt": "2025-12-02T20:35:19.180Z",
  "updatedAt": "2025-12-02T20:35:19.180Z",
  "date": "2025-12-02",
  "excerpt": "SB 1123 proposes changes to California's subdivision and zoning laws, affecting how local agencies review small housing developments. Key updates include revised parcel size limits, density requirements, and treatment of accessory dwelling units.",
  "image": "https://res.cloudinary.com/dfr4brde4/image/upload/v1764707716/flipwise/blog/sb-1123-updates-subdivision-review-rules-1764707714603.jpg",
  "content": [
    {
      "type": "subheader",
      "text": "Key Changes in SB 1123"
    },
    {
      "type": "list",
      "items": [
        "Accessory dwelling units (ADUs) and junior ADUs will not count toward the 10-unit limit for ministerial subdivision review if permitted by the local agency.",
        "Vacant lots zoned for single-family residential development can be up to 1.5 acres, with newly created parcels no smaller than 1,200 square feet.",
        "Local agencies may impose height limits on vacant, single-family zoned lots.",
        "Subdivisions cannot result in existing dwelling units being separated from their titles.",
        "Tenancy in common arrangements are now included as qualifying ownership structures, along with community trusts.",
        "For parcels not listed in the housing element, developments must achieve at least 66% of the maximum allowable residential density.",
        "Minimum frontage requirements for new parcels are eliminated, beyond the minimum parcel size."
      ]
    },
    {
      "type": "subheader",
      "text": "Investor Takeaways"
    },
    {
      "type": "paragraph",
      "text": "These updates streamline the approval process for small-scale housing developments and expand eligibility for certain ownership structures. Investors should note the increased flexibility in parcel size, density, and ownership models, as well as the July 1, 2025 effective date."
    }
  ]
}